app/controllers/clues_controller.rb

  def show
    @clue = @team.clues.find(params[:id])
---
SELECT * FROM "clues" WHERE ("clues"."id" = 4 AND ("clues".team_id = 1))

  def edit
    @clue = @team.clues.find(params[:id])
---
SELECT * FROM "clues" WHERE ("clues"."id" = 5 AND ("clues".team_id = 2))

  def create
    @clue = @team.clues.new(params[:clue])

    respond_to do |format|
      if @clue.save
---
INSERT INTO "clues" ("team_id", "updated_at", "photo_file_name", "photo_file_size", "caption", "photo_content_type", "lat", "long", "created_at", "scenario_id") VALUES(2, '2010-04-22 04:56:15', 'DSC_0072.JPG', 2856036, 'A snowy landscape.', 'image/jpeg', NULL, NULL, '2010-04-22 04:56:15', NULL)

  def update
    @clue = @team.clues.find(params[:id])

    respond_to do |format|
      if @clue.update_attributes(params[:clue])
---
SELECT * FROM "clues" WHERE ("clues"."id" = 5 AND ("clues".team_id = 2))
UPDATE "clues" SET "photo_content_type" = 'image/jpeg', "photo_file_name" = 'happy_valentines_tea.jpg', "photo_file_size" = 31362, "caption" = '', "updated_at" = '2010-04-22 06:04:30' WHERE "id" = 2

  def destroy
    @clue = @team.clues.find(params[:id])
    @clue.destroy
---
SELECT * FROM "clues" WHERE ("clues"."id" = 2 AND ("clues".team_id = 1))
DELETE FROM "clues" WHERE "id" = 2

  def set_team
    @team = Team.find(params[:team_id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 2)