app/controllers/plays_controller.rb

SELECT * FROM "plays" WHERE ("plays"."id" = 1)
---
  def show
    @play = Play.find(params[:id])

INSERT INTO "plays" ("updated_at", "winning_team_id", "lat", "duration", "scenario_id", "long", "start_time", "created_at") VALUES('2010-04-22 19:10:52', NULL, NULL, NULL, 1, NULL, NULL, '2010-04-22 19:10:52')
---
  def create
    @play = Play.new({:scenario_id => params[:scenario_id]})

    respond_to do |format|
      if @play.save