app/controllers/scenarios_controller.rb

SELECT * FROM "scenarios"
---
  def index
    @scenarios = Scenario.all

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)
---
  def show
    @scenario = Scenario.find(params[:id])

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)
---
  def edit
    @scenario = Scenario.find(params[:id])

INSERT INTO "scenarios" ("updated_at", "title", "starting_lat", "starting_long", "description", "duration", "created_at") VALUES('2010-04-21 21:58:42', 'Case of the Costly Casket', NULL, NULL, 'A mysterious statue has appeared in the courtyard between Kroeber and Wurster. Alas, your art professor went $1million over budget when he purchased it. His colleagues are now grumbling that the statue is worthless and aesthetically uninteresting. Help save your professor''s job! In the next [ ] minutes, your team must gather evidence and develop an argument that justifies your professor''s decision. Teams will earn points for the most pieces of evidence, the widest territory covered, and the most compelling story that links the evidence together.', 20, '2010-04-21 21:58:42')
---
  def create
    @scenario = Scenario.new(params[:scenario])

    respond_to do |format|
      if @scenario.save

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)
UPDATE "scenarios" SET "address" = 'Kroeber Hall, Berkeley, CA', "updated_at" = '2010-04-22 19:21:40' WHERE "id" = 1
---
  def update
    @scenario = Scenario.find(params[:id])

    respond_to do |format|
      if @scenario.update_attributes(params[:scenario])